app/views/relation/index.html.erb

        <td><%= relation.target_user_code %></td>
        <td><%= User.find_by_user_code(relation.target_user_code).nick_name%></td>
---
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test1' LIMIT 1