app/views/portal/_relations.html.erb

SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test2' LIMIT 1
SELECT "relation_statuses".* FROM "relation_statuses" WHERE "relation_statuses"."status_code" IS NULL LIMIT 1
---
      <td><%= relation.target_user_code %></td>
      <td><%= User.find_by_user_code(relation.target_user_code).nick_name%></td>
      <td><%= RelationStatus.find_by_status_code(relation.relation_status_code).status_name %></td>