app/views/portal/_tweet.html.erb

      <td>
        <%= User.find_by_user_code(tweet.user_code).nick_name %><br>
---
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test4' LIMIT 1