app/views/portal/index.html.erb

                  <td>
                    <%= User.find_by_user_code(tweet.user_code).nick_name %><br>
---
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test1' LIMIT 1

              <td>
                <% questionnaire.questionnaire_votes.each do |vote| %>
---
SELECT "questionnaire_votes".* FROM "questionnaire_votes" WHERE "questionnaire_votes"."questionnaire_id" = 15
SELECT "questionnaires".* FROM "questionnaires"

              <td><%= User.find_by_user_code(relation.target_user_code).nick_name%></td>
              <td><%= RelationStatus.find_by_status_code(relation.relation_status_code).status_name %></td>
---
SELECT "relation_statuses".* FROM "relation_statuses" WHERE "relation_statuses"."status_code" = '2' LIMIT 1
SELECT "user_relations".* FROM "user_relations" WHERE (user_code = 'test1' AND relation_status_code != '1')