app/controllers/portal_controller.rb

SELECT "relationships".* FROM "relationships" ORDER BY id
SELECT "user_relations".* FROM "user_relations" WHERE (user_code = 'test1' AND relation_status_code != '1')
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test1' LIMIT 1
SELECT "tweets".* FROM "tweets" WHERE (user_code in('test1')) ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT "photoframes".* FROM "photoframes"
SELECT "questionnaires".* FROM "questionnaires"
---
  def index
    @user = session[:login_user]

    #続柄プルダウンデータを取得
    @relation_type = Relationship.order(:id).map{|relation|[relation.relationship_name, relation.relationship_cd]}

    # ログインユーザの持つ承認済のつながり（他のユーザとの関係）を取得します
    @relations = UserRelation.where('user_code = :user_code AND relation_status_code = :relation_status_code',
                                    {user_code: @user.user_code, relation_status_code: '1'})

    # ログインユーザの持つ未承認のつながり（他のユーザとの関係）を取得します
    @pre_relations = UserRelation.where('user_code = :user_code AND relation_status_code != :relation_status_code',
                                        {user_code: @user.user_code, relation_status_code: '1'})

    #tweet-tlの初期データを取得
    relations = UserRelation.find_all_by_user_code(@user.user_code)

    relation_user_codes = Array.new relations.length
    relation_user_codes << @user.user_code
    relations.each do |relation|
      relation_user_codes << relation.target_user_code
    end

    @tweets = Tweet.where("user_code in(?)", relation_user_codes).order("created_at DESC").offset(0).limit(20)

    @photoframes = Photoframe.all
    @questionnaires = Questionnaire.all

INSERT INTO "tweets" ("created_at", "tweet_text", "updated_at", "user_code") VALUES (?, ?, ?, ?)  [["created_at", Sat, 20 Oct 2012 07:59:50 UTC +00:00], ["tweet_text", "aaa"], ["updated_at", Sat, 20 Oct 2012 07:59:50 UTC +00:00], ["user_code", "test"]]
---
  def tweet
    user = session[:login_user]
    tweet = Tweet.new user_code: user.user_code ,tweet_text: params[:tweet_text]
    tweet.save

SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."user_code" = 'test1'
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test4' LIMIT 1
---
  def gettweet
    @user = session[:login_user]
    relations = UserRelation.find_all_by_user_code(@user.user_code)

SELECT "relationships".* FROM "relationships" ORDER BY id
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."user_code" = 'test1'
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test2' LIMIT 1
---
  def relations
    user = session[:login_user]

    #続柄プルダウンデータを取得
    @relation_type = Relationship.order(:id).map{|relation|[relation.relationship_name, relation.relationship_cd]}

    if !user
      flash[:notice] = 'まずはログインしなさい 話はそれからです'
      redirect_to controller: 'top', action: 'index'
    end

    # ログインユーザの持つつながり（他のユーザとの関係）を取得します
    @relations = UserRelation.find_all_by_user_code(user.user_code)

SELECT "user_relations".* FROM "user_relations" WHERE (user_code = 'test1' AND relation_status_code != '1')
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test2' LIMIT 1
---
  def prerelations
    user = session[:login_user]

    if !user
      flash[:notice] = 'まずはログインしなさい 話はそれからです'
      redirect_to controller: 'top', action: 'index'
    end

    # ログインユーザの持つ未承認のつながり（他のユーザとの関係）を取得します
    @pre_relations = UserRelation.where('user_code = :user_code AND relation_status_code != :relation_status_code',
                                        {user_code: user.user_code, relation_status_code: '1'})