app/controllers/questionnaire_controller.rb

INSERT INTO "questionnaires" ("created_at", "description", "end_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 04 Nov 2012 23:04:39 UTC +00:00], ["description", "アンケート説明"], ["end_date", Thu, 31 Dec 2099], ["title", nil], ["updated_at", Sun, 04 Nov 2012 23:04:39 UTC +00:00]]
INSERT INTO "questionnaire_votes" ("created_at", "option_id", "option_text", "questionnaire_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 04 Nov 2012 23:21:13 UTC +00:00], ["option_id", "1"], ["option_text", ""], ["questionnaire_id", 23], ["updated_at", Sun, 04 Nov 2012 23:21:13 UTC +00:00]]
---
  def new
    questionnaire = Questionnaire.new title: params[:title],
                                      description: 'アンケート説明',
                                      end_date: '2099-12-31'

    questionnaire.save

    vote1 = questionnaire.questionnaire_votes.build(option_id: '1', option_text: params[:option1])
    vote1.save