app/controllers/relation_controller.rb

SELECT "relationships".* FROM "relationships" ORDER BY id
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."user_code" = 'test'
SELECT "users".* FROM "users" WHERE "users"."user_code" = 'test1' LIMIT 1
---
  def index
    user = session[:login_user]

    #続柄プルダウンデータを取得
    @relation_type = Relationship.order(:id).map{|relation|[relation.relationship_name, relation.relationship_cd]}

    if !user
      flash[:notice] = 'まずはログインしなさい 話はそれからです'
      redirect_to controller: 'top', action: 'index'
    end

    # ログインユーザの持つつながり（他のユーザとの関係）を取得します
    @relations = UserRelation.find_all_by_user_code(user.user_code)

SELECT "users".* FROM "users" WHERE "users"."user_code" = 'zzzz' LIMIT 1
SELECT 1 AS one FROM "user_relations" WHERE (user_code = 'test' AND target_user_code = 'test2') LIMIT 1
INSERT INTO "user_relations" ("created_at", "relation_level", "relation_status_code", "relationship_cd", "target_user_code", "updated_at", "user_code") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    user = session[:login_user]

    # 自分でないかチェック
    if user.user_code == params[:target_user_code]
      flash[:notice] = 'それはおまえだ'
    # 存在しないユーザが指定されていないかチェック
    elsif !User.find_by_user_code(params[:target_user_code])
      flash[:notice] = 'そんなやつはいない'
    # 既に登録済でないかチェック
    elsif UserRelation.where('user_code = ? AND target_user_code = ?', user.user_code, params[:target_user_code]).exists?
      flash[:notice] = 'すでにつながっている'
    else
      UserRelation.create(user_code: user.user_code, target_user_code: params[:target_user_code], relationship_cd: 1, relation_level: 1, relation_status_code: '2').save