app/controllers/top_controller.rb

  def login
    user = User.find_by_user_code(params[:user_code])
---
SELECT "users".* FROM "users" WHERE "users"."user_code" = '' LIMIT 1